package com.example.george.test_aegean_app;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.TextView;

public class FoodActivity extends AppCompatActivity {

    private TextView txtview;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_food_activity);

        txtview = (TextView) findViewById(R.id.textView11);

        Intent intent = getIntent();
        String week = intent.getStringExtra("week");
        String daytime = intent.getStringExtra("daytime");

        int weeknum = Integer.parseInt(week);
        int daytimenum = Integer.parseInt(daytime);


        if (daytimenum == 2) {

        } else if (daytimenum == 1) {

        }

        if (weeknum == 1) {
            if (daytimenum == 2) {
                getSupportActionBar().setTitle("1η Εβδομάδα Βραδινό");
                txtview.setText("Δευτέρα \n1ο.Κρεμμυδόσουπα - Κρέπες ( γέμιση με ζαμπόν και μανιτάρια) \n2ο.Σπαγγέτι με σάλτσα ντομάτας, τυρί τριμμένο, τυρί φέτα - Πατάτες γιαχνί, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤρίτη \n1ο.Σούπα κρέμα σπανάκι - Σουφλέ λαζάνια \n2ο.Ψάρι φούρνου με πατατοσαλάτα - Κιμαδόπιτα, πατατοσαλάτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤετάρτη \n1ο.Ψαρόσουπα - Σουφλέ πατάτας \n2ο.Ογκρατέν (Μακαρόνια), τυρί φέτα - Μελιτζάνες ιμάμι, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχή \n \nΠέμπτη \n1ο.Σούπα με μακαρονάκι και φασόλια - Τορτίγιες με πατάτες και φρέσκο κρεμμύδι \n2ο.Σουτζουκάκια με γαρνιτούρα ζυμαρικά με σάλτσα ντομάτας - Χυλοπίτες Πηλιορίτικες, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΠαρασκευή \n1ο.Σούπα μπεαρναίζ - Κρέπες (γέμιση ροκφόρ) \n2ο.Ομελέτα με πατάτες, τυρί φέτα - Τυρόπιτα, κοφτό μακαρονάκι \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΣάββατο \n1ο.Σούπα Σαβουαγιάρντ - Μελιτζανόπιτα \n2ο.Θράψαλα τηγανιτά με πιλάφι - Μπιφτέκι σχάρας με πιλάφι \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΚυριακή \n1ο.Σούπα μπιστού - Παραδοσιακή μλήνα Σερρών \n2ο.Γαλοπούλα στήθος φέτα, πιλάφι, πιλάφι, τυρί φέτα - Πίτσα σπέσιαλ \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n");
            } else if (daytimenum == 1) {
                getSupportActionBar().setTitle("1η Εβδομάδα Μεσημεριανό");
                txtview.setText("Δευτέρα \n1ο.Κρεατόσουπα με διάφορα λαχανικά - Τορτίγιες με λαχανικά \n2ο.Μουσακάς - Καλαμαράκια γιαχνί με πιλάφι \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤρίτη \n1ο.Σούπα Ριζότο μανιτάρια - Μακεδονίτικη κολοκυθόπιτα \n2ο.Κοτόπουλο κοκκινιστό με αρακά, τυρί φέτα - Χοιρινό κοντοσούβλι του ΣΕΦ, πατάτες φούρνου \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤετάρτη \n1ο.Μινεστρόνι αλά Μιλανέζε - Ντολμαδάκια γιαλατζί \n2ο.Φασόλια γίγαντες φούρνου, τυρί φέτα, ελιές - Αγκινάρες αλά πολίτα, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΠέμπτη \n1ο.Κρεατόσουπα με κριθαράκι - Πίτα Καισαρείας \n2ο.Μπριζόλα Χοιρινή με πουρέ πατάτας - Κοτόπουλο εντσιλάντας με κοχυλάκια , τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΠαρασκευή \n1ο.Ντολμαδάκια βελουτέ - Φρουτάλια με πατάτα κια λουκάνικα \n2ο.Φακές σούπα, ελιές, τυρί φέτα - Σουφλέ λαζάνια με κιμά, τυρί τριμμένο, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΣάββατο \n1ο.Κρεατόσουπα - Καλαμαράκια κρασάτα \n2ο.Μοσχάρι Ορλώφ, με ζυμαρικά - Κοτόπουλο λεμονάτο στο φούρνο με πατάτες, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΚυριακή \n1ο.Χορτόσουπα - Κρέπες (γέμιση τυρί) \n2ο.Χοιρινό γιουβέτσι - Μοσχάρι σούπα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n");
            }
        } else if (weeknum == 2) {
            if (daytimenum == 2) {
                getSupportActionBar().setTitle("2η Εβδομάδα Βραδινό");
                txtview.setText("Δευτέρα \n1ο.Σούπα λουγκσάν - Ομελέτα στραπατσάδα \n2ο.Σπανακόρυζο, τυρί φέτα - Μακαρονάκι τυμπάλ, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤρίτη \n1ο.Κοτόπουλο αυγολέμονο - Κρέπες ( γέμιση ζαμπόν κρεμμύδια) \n2ο.Κεφτέδες με πουρέ πατάτας - Ψαρόσουπα και πατατοσαλάτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤετάρτη \n1ο.Σούπα με κοκκινιστό τραχανά - Στριφτή τυρόπιτα Κοζανίτικη \n2ο.Αρακάς, τυρί φέτα - Σπαγγέτι με κιμά, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχή \n \nΠέμπτη \n1ο.Σούπα βελουτέ πατάτας - Μακεδονίτικη κολοκυθόπιτα \n2ο.Σουτζουκάκια σμυρνέικα με ζυμαρικά - Ριζότο με θαλασσινά, τυρί γκούντα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΠαρασκευή \n1ο.Αρακόσουπα με πράσο - Σπανακοτυρόπιτα Καστοριάς \n2ο.Σπανακοτυρόπιτα, πατάτες νιοφίν - Ομελέτα αλά Αμερικέν, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΣάββατο \n1ο.Καροτόσουπα βελουτέ με πράσα - Ψάρι εποχής (ψιλό) τηγανητό \n2ο.Πρεβεζιάνικος μπακαλιάρος φιλέτο με πράσα, σουφλέ λαχανικών - Μπιτόγκ αλά Ρους, πουρές πατάτας \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΚυριακή \n1ο.Σούπα γαλοπούλας με λαχανικά - Κρέπες (γέμιση με ζαμπόν και τυρί) \n2ο.Γαλοπούλα σπέσιαλ, ρολό, πατάτες αλά χασάπα, τυρί φέτα - Τυρόπιτα στριμμένη με μυζήθρα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n");
            } else if (daytimenum == 1) {
                getSupportActionBar().setTitle("2η Εβδομάδα Μεσημεριανό");
                txtview.setText("Δευτέρα \n1ο.Σούπα κρέσυ - Κοζανίτικο κτχι με φέτα και πράσο \n2ο.Φιλέτα γαλέου, πουρές πατάτας - Παστίτσιο \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤρίτη \n1ο.Σούπα κάρδαμο - Τονοσαλάτα \n2ο. Κοτόπουλο ψητό ,ε ζυμαρικά, τυρί φέτα - Χοιρινό λεμονάτο στο φούρνο με πατάτες \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤετάρτη \n1ο.Σούπα αλενουά - Λαχανοντολμάδες αυγολέμονο \n2ο.Φασόλια φούρνου, τυρί φέτα - Μπάμιες, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχή \n \nΠέμπτη \n1ο.Σούπα κρέμα αγκινάρας - Ντολμαδάκια αυγολέμονο \n2ο.Κοτόπουλο Σαιν Ζερμέν με πιλάφι, τυρί φέτα - Χοιρινό κρασάτο με ρύζι \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΠαρασκευή \n1ο.Σούπα κρέμας μπρόκολο - Σουπιές σπανάκι \n2ο.Ρεβίθια φούρνου, τυρί φέτα - Σπαγγέτι καρμπονάρα, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΣάββατο \n1ο.Σούπα σαμπενουά - Εντσιλάδας με λουκάνικο \n2ο.Μοσχάρι Κελαηδί λάρισας, σουφλέ ζυμαρικών - Κοτόπουλο Μιλανέζε, σουφλέ λαχανικών, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΚυριακή \n1ο.Σούπα ντυπαρύ - Burittos με ομελέτα ( ελληνικός τρόπος) \n2ο.Αρνί γιουβέτσι - Μοσχάρι φαντασία με ραβιόλια \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n");
            }
        } else if (weeknum == 3) {
            if (daytimenum == 2) {
                getSupportActionBar().setTitle("3η Εβδομάδα Βραδινό");
                txtview.setText("Δευτέρα \n1ο.Σούπα με κρέμα σπανάκι - Ντολμαδάκια γιαλατζί \n2ο.Γεμιστά, τυρί φέτα - Χυλοπίτες Πυλιορίτκες \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤρίτη \n1ο.Σούπα μακαρονάκι και φασόλια - Τυροπιτάκια \n2ο.Κεφτεδάκια παραδοσικά φούρνου και πατάτες φούρνου - Ψάρι φουύρνου με πατατοσαλάτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤετάρτη \n1ο.Σούπα Σαβουαγιάρντ - Κρέπες με γέμιση μανιτάρια \n2ο.Μενέστρα Ελασσόνας, τυρί φέτα - Μπριάμ, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχή \n \nΠέμπτη \n1ο.Σουπα Μπεαρναίζ - Ομελέτα στραπατσάδα \n2ο.Μπιφτεέκι με ζυμαρικά  - Fussili φούρνου με χταπόδι \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΠαρασκευή \n1ο.Σούπα μπιστού - Σαλάτα κοχυλάκι \n2ο.Πρασόπιτα με ζαμπόν - Ομελέτα φούρνου,τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΣάββατο \n1ο.Σουπα κρέσυ - Σπανακοτυρόπιτα Καστοριάς \n2ο.Ψάρι εποχής φρέσκο πλακί - Ρολό κιμά πατάτες ριγανάτες \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΚυριακή \n1ο.Σούπα κάρδαμο - Κιμαδοκουλούρες \n2ο.Χορτοπικα κεφαλλονίτικη  - Κοτόπυλο ραβιόλια, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n");
            } else if (daytimenum == 1) {
                getSupportActionBar().setTitle("3η Εβδομάδα Μεσημεριανό");
                txtview.setText("Δευτέρα \n1ο.Κρεατόσουπα με διάφορα λαχανικά - Ομελέτα με κρεμμύδια, πιπερίες, ντόματα, τυρί \n2ο.Λαζανάκι με κιμά, τυρί φέτα - Ψάρι φιλέτο γκούλας με ρύζι καρότα και αρακά \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤρίτη \n1ο.Σούπα Ρυζότο μανιτάρια - Καλαμαράκια βραστά σαλάτα \n2ο.Κοτόπουλο συμπρέμ αλα κρεμ με μακαρονάκι κοφτο, τυρί φέτα - Σουβλάκι χοιρνό πατάτες φούρνου λεμονάτες \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤετάρτη \n1ο.Κρεατόσουπα κριθαράκι - Κολοκυθοκευτέδες με άνηθο και φέτα \n2ο.Φασόλια μαυρομάτικα, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχή \n \nΠέμπτη \n1ο.Ντοματόσουπα βελουτέ \n2ο.Χοιρινό με πράσο - Κοτόπουλο γιουβέτσι, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΠαρασκευή \n1ο.Ψαρόσουπα - Τορτίγιες με λαχανικά \n2ο.Φάβα τυρί, φέτα, ελιές - Τατιατέλλες πράσινες με ντομάτα,τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΣάββατο \n1ο.Χορτόσουπα - Πίτα Καισάρειας \n2ο.Μοσχάρι γκούλας με ριζότο - Κοτόπουλο γεμιστό Ρομάνα με πέννες, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΚυριακή \n1ο.Κρεμμυδόσουπα - Σουφλέ ψαριού \n2ο.Χοιρινή τηγανιά με πατάτες τηγανιτές  - Μοσχάρι κοκκινιστό με κριθαράκι \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n");
            }
        } else if (weeknum == 4) {
            if (daytimenum == 2) {
                getSupportActionBar().setTitle("4η Εβδομάδα Βραδινό");
                txtview.setText("Δευτέρα \n1ο.Σούπα με κοκκινιστό τραχανά -  Φασόλια σαλάτα με τόνο \n2ο.Ρεγκατόνι με σάλτσα τόνου - Σπανακόρυζο, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤρίτη \n1ο.Σούπα με σπανάκι - Τυροσαλάτα \n2ο.Γιουβαρλάκια αυγολέμονο - Παλαμίδα αυγολέμονο με κους κους \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤετάρτη \n1ο.Σούπα βελουτέ πατάτας - Πατατοσαλάτα με ελιές \n2ο.Λαχανόρυζο με κόκκινι σάλτσα, τυρί φέτα - Πενάκι με μυζήθρα και σαγκινάρες, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχή \n \nΠέμπτη \n1ο.Καροτόσουπα βελουτέ - Τορτίγιες με πατάτες και φρέσκο κρεμμύδι \n2ο.Μπιτόκ αλα Ονγκουάζ πατάτες γιαχνί - Ταλιατέλες με σάλτσα πέστο, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΠαρασκευή \n1ο.Αρακόσουπα με πράσσα - Μελιτζάνες φούρνου με τυρί \n2ο.Τυρόπιτα στο τηγάνι πατατοσαλάτα - Ομελέτα φλαμπέ πατάτες φουρνου ριγανάτες, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΣάββατο \n1ο.Κοτόσουπα αυγολέμονο - Εντσιλάδες με λουκάνικο \n2ο.Παποθτσάκια με μελιτζάνες και κιμά, τυρί φέτα - Ψάρι φιλέτο σεϊθ λεμονάτο \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΚυριακή \n1ο.Σούπα γαλοπύλας με λαχανικά - Σουφλέ τυριού με μπεσαμέλ \n2ο.Σπανακόπιτα, κριθαράκι φούρνου  - Κοτόπουλο μπελ ωρόρ με πιλάφι,τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n");
            } else if (daytimenum == 1) {
                getSupportActionBar().setTitle("4η Εβδομάδα Μεσημεριανό");
                txtview.setText("Δευτέρα \n1ο.Σούπα αλενουά - Τονοσαλάτα \n2ο.Ψάρι αλα σπετσιώτα - Μακαρόνια με μπαλάκια κιμά κοκκινιστά, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤρίτη \n1ο.Σούπα κρέμα αγκινάρες - Μελιτζανόπιτα \n2ο.Κοτόπουλο δεντρολίβανο με πατάτες φούρνου, τυρί φέτα - Χοιρνό ψητό με πιλάφι \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΤετάρτη \n1ο.Σούπα κρέμα μπρόκολο - Μακεδονίτικη πρασοκιμαδότπιτα \n2ο.Φασόλια σούπα, τυρί φέτα - Αγκινάρες βινεγκρέτ, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχή \n \nΠέμπτη \n1ο.Σούπα σαμπενουά - Burritos με ομελέτα \n2ο.Χοιρινά φιλετάκια με μουστάρδα και πατάτες φούρνου - Γαλοπούλα με χυλοπίτες, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΠαρασκευή \n1ο.Σούπα ντύπαρύ - Τορτίγιες με λιωμένο τυρι και κιμά \n2ο.Φάβα Μυτιλήνης - Σουφλέ ζυμαρικών \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΣάββατο \n1ο.Σούπα λουγκσόν - Πίτα Σικελίας \n2ο.Μοσχάρι σουφλέ με κρητικό γαμοπίλαφο - Κοτόπουλο ψητό με πατάτες τηγανητές, τυρί φέτα \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n \nΚυριακή \n1ο.Κοτόσουπα αυγολέμονο - Σαλάτα Βουδαπέστης \n2ο.Χοιρινό σνιτσελ με ριζότο  - Μοσχάρι φαντασία με ζυμαρικά \n3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή \n4ο.Γλυκό - Φρούτο εποχής \n");
            }
        }


    }
}
